MYTHRI R J
+917026207970
mythrijain9@gmail.com

In [37]:
import pandas as pd
import pandasql as psql
from pandasql import sqldf

In [7]:
database_file = {
    "mesg_trn_no":['TF1005','TF1006','TF1005','TF1005','TF1006'],
    "Mesg_type":[700,710,710,707,707],
    "Field_code": [50,59,59,50,59],
    "Field_value": ['CVC','PVC','Mahindra','Mahindra','AVON'],
    "mesg_crea_date_time": ['10/10/2020','1/09/2020','12/10/2020','12/11/2020','17/11/2020']
}

In [8]:
df = pd.DataFrame(database_file)

In [9]:
df['mesg_crea_date_time'] = pd.to_datetime(df['mesg_crea_date_time'])

In [10]:
df

  mesg_trn_no  Mesg_type  Field_code Field_value mesg_crea_date_time
0      TF1005        700          50         CVC          2020-10-10
1      TF1006        710          59         PVC          2020-01-09
2      TF1005        710          59    Mahindra          2020-12-10
3      TF1005        707          50    Mahindra          2020-12-11
4      TF1006        707          59        AVON          2020-11-17

Find the latest Field_value of Field_code for each mesg_trn_no

Solution

In [12]:
pysqldf = lambda x: sqldf(x, globals())

In [13]:
query1= """
        SELECT *
        FROM(SELECT mesg_trn_no,Field_code, Field_value,mesg_crea_date_time
            FROM df
            ORDER BY mesg_crea_date_time DESC)
        GROUP BY mesg_trn_no 
        """

In [14]:
print(pysqldf(query1))

  mesg_trn_no  Field_code Field_value         mesg_crea_date_time
0      TF1005          50    Mahindra  2020-12-11 00:00:00.000000
1      TF1006          59        AVON  2020-11-17 00:00:00.000000

2.

In [15]:

database_file2 = {
    'ID':[1002,1003,1004,1005],
    'queuename': ['Maker','Checker','Exception','Exception'],
    'entrydate': ['1/10/2020','2/10/2020','17/11/2020','15/11/2020']
}

In [16]:
case_details = pd.DataFrame(database_file2)

In [17]:
database_file2 = {
    'ID':['1005','1004','1004','1005'],
    'queuename':['Exception','Exception','Exception','Exception'],
    'exception_comment':['ID card missed','signature mismatch','ID missed','Signature mismatch'],
    'actiondate':['4/09/2020','1/09/2020','17/11/2020','15/11/2020'] 
}

In [18]:
exceptionview = pd.DataFrame(database_file2)

In [19]:
case_details['entrydate'] = pd.to_datetime(case_details['entrydate'])

In [20]:
exceptionview['actiondate'] = pd.to_datetime(exceptionview['actiondate'])

In [21]:
exceptionview

     ID  queuename   exception_comment actiondate
0  1005  Exception      ID card missed 2020-04-09
1  1004  Exception  signature mismatch 2020-01-09
2  1004  Exception           ID missed 2020-11-17
3  1005  Exception  Signature mismatch 2020-11-15

In [22]:
case_details

     ID  queuename  entrydate
0  1002      Maker 2020-01-10
1  1003    Checker 2020-02-10
2  1004  Exception 2020-11-17
3  1005  Exception 2020-11-15

Solution

In [32]:
query2 = """
        SELECT ID,queuename,COALESCE(exception_comment,'NA') AS exception_comment ,entrydate
        
        FROM (SELECT *
        FROM case_details
        LEFT JOIN exceptionview ON case_details.entrydate= exceptionview.actiondate
        ORDER BY case_details.ID DESC) AS join_table
        """

In [33]:
pysqldf(query2)

     ID  queuename   exception_comment                   entrydate
0  1005  Exception  Signature mismatch  2020-11-15 00:00:00.000000
1  1004  Exception           ID missed  2020-11-17 00:00:00.000000
2  1003    Checker                  NA  2020-02-10 00:00:00.000000
3  1002      Maker                  NA  2020-01-10 00:00:00.000000

3.Question

In [34]:
database_file4 = {
    'cif_no':['068974561','067897945','052345689'],
    'Debit_card':['123456768989','560889767867','454578982324']
}

In [35]:
MyTable = pd.DataFrame(database_file4)

In [36]:
MyTable

      cif_no    Debit_card
0  068974561  123456768989
1  067897945  560889767867
2  052345689  454578982324

#solution 3rd question

In [27]:
query3= """
    SELECT Substr(Debit_card,1,4)||'XXXX' ||Substr(Debit_card,-4) as debit_card_No
    FROM MyTable
   """

In [28]:
pysqldf(query3)

  debit_card_No
0  1234XXXX8989
1  5608XXXX7867
2  4545XXXX2324